// Задача 64: Задайте значение M и N. Напишите программу, которая выведет 
// все натуральные числа в промежутке от N до M. Выполнить с помощью рекурсии.
// M = 1; N = 5. -> "5,4,3,2,1"
// M = 4; N = 8. -> "8, 7, 6, 5, 4"

// Console.Clear();
// Console.Write("Введите M: ");
// int m = int.Parse(Console.ReadLine());
// Console.Write("Введите N: ");
// int n = int.Parse(Console.ReadLine());

// Console.WriteLine(PrintNumbers(n, m));

// string PrintNumbers(int start, int end)
// {
//     if (start == end)
//         return start.ToString();
//     return (start + " " + PrintNumbers(start - 1, end));
// }


// Решение преподователя
